---

C#Visual BasicVisual C++

Revit 2024 API
---
Connector..::..ConnectTo Method
Connector Class See Also Send Feedback
---

Make connection between two connectors.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public void ConnectTo(
    	Connector connector
    )

Visual Basic
---

    Public Sub ConnectTo ( _
    	connector As Connector _
    )

Visual C++
---

    public:
    void ConnectTo(
    	Connector^ connector
    )

#### Parameters

connector
    Type: Autodesk.Revit.DB..::..ConnectorIndicate the connector will be connected to.

# Remarks

Connection success may create a new Fitting between two connectors, if necessary.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when argument is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Argument is invalid. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when two connectors with different domain types. Thrown when these two connectors fail to connect each other. Thrown when connection already exists. |

# See Also

Connector Class

Autodesk.Revit.DB Namespace